---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.MultiReferenceAnnotation
source: html/7c68a8a6-0f8c-357c-4591-ee494b3110e9.htm
---
# MultiReferenceAnnotation Members

The method validates if the input elements match the element category id for the MultiReferenceAnnotationType.